Autodesk.Revit.DB.Structure.StructuralConnectionType.GetAllStructuralConnectionTypeIds(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId}@)
Collects the ids of all StructuralConnectionTypes in the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011